markluo0311/nrf52832_bt_mesh/mesh/src/access/access.c
static void mesh_msg_handle(nrf_mesh_evt_message_t * p_evt)
{
    NRF_MESH_ASSERT(p_evt != NULL);
    access_opcode_t opcode = access_opcode_get(p_evt->p_buffer);
    if (opcode.opcode == ACCESS_OPCODE_INVALID)
    {
        return;
    }
    __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "RX: [aop: 0x%04x]\n", opcode.opcode);

    /*lint -save -e64 -e446 Side effects and type mismatches in initializer */
    dsm_handle_t appkey_handle = dsm_appkey_handle_get(p_evt->secmat.p_app);
    access_message_rx_t message =
        {
            .opcode = opcode,
            .p_data = &p_evt->p_buffer[access_utils_opcode_size_get(opcode)],
            .length = p_evt->length - access_utils_opcode_size_get(opcode),
            .meta_data.src.type = p_evt->src.type,
            .meta_data.src.value = p_evt->src.value,
            .meta_data.src.p_virtual_uuid = p_evt->src.p_virtual_uuid,
            .meta_data.dst.type = p_evt->dst.type,
            .meta_data.dst.value = p_evt->dst.value,
            .meta_data.dst.p_virtual_uuid = p_evt->dst.p_virtual_uuid,
            .meta_data.timestamp = 0, /* TODO */
            .meta_data.ttl = p_evt->ttl,
            .meta_data.appkey_handle = appkey_handle
        };
    /*lint -restore */

    if (p_evt->dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
    {
        dsm_local_unicast_address_t local_addresses;
        dsm_local_unicast_addresses_get(&local_addresses);
        if (p_evt->dst.value >= local_addresses.address_start &&
            p_evt->dst.value <  (local_addresses.address_start + local_addresses.count))
        {
            uint16_t element_index = p_evt->dst.value - local_addresses.address_start;
            for (int i = 0; i < ACCESS_MODEL_COUNT; ++i)
            {
                access_common_t * p_model = &m_model_pool[i];
                uint32_t opcode_index;
                if (ACCESS_INTERNAL_STATE_IS_ALLOCATED(p_model->internal_state) &&
                    p_model->model_info.element_index == element_index &&
                    bitfield_get(p_model->model_info.application_keys_bitfield, appkey_handle) &&
                    is_opcode_of_model(p_model, opcode, &opcode_index))
                {
                    access_reliable_message_rx_cb(i, &message, p_model->p_args);
                    p_model->p_opcode_handlers[opcode_index].handler(i, &message, p_model->p_args);
                }
            }
        }
    }
    else
    {
        dsm_handle_t address_handle = DSM_HANDLE_INVALID;
        /* If it's not one of the element addresses, it has to be a subscription address. */
        NRF_MESH_ERROR_CHECK(dsm_address_handle_get(&p_evt->dst, &address_handle));
        NRF_MESH_ASSERT(dsm_address_subscription_get(address_handle));
        for (int i = 0; i < ACCESS_MODEL_COUNT; ++i)
        {
            access_common_t * p_model = &m_model_pool[i];
            uint32_t opcode_index;

            if (ACCESS_INTERNAL_STATE_IS_ALLOCATED(p_model->internal_state) &&
                ACCESS_SUBSCRIPTION_LIST_COUNT > p_model->model_info.subscription_pool_index  &&
                bitfield_get(p_model->model_info.application_keys_bitfield, appkey_handle) &&
                bitfield_get(m_subscription_list_pool[p_model->model_info.subscription_pool_index].bitfield, address_handle) &&
                is_opcode_of_model(p_model, opcode, &opcode_index))
            {
                p_model->p_opcode_handlers[opcode_index].handler(i, &message, p_model->p_args);
            }
        }
    }
}

static void mesh_evt_cb(nrf_mesh_evt_t * p_evt)
{
    switch (p_evt->type)
    {
        case NRF_MESH_EVT_MESSAGE_RECEIVED:
            mesh_msg_handle(&p_evt->params.message);
            break;
        default:
            /* Ignore */
            break;
    }

}

static bool check_tx_params(access_model_handle_t handle, const access_message_tx_t * p_tx_message, const access_message_rx_t * p_rx_message, uint32_t * p_status)
{
    NRF_MESH_ASSERT(NULL != p_status);
    if (p_tx_message->length >= ACCESS_MESSAGE_LENGTH_MAX)
    {
        *p_status = NRF_ERROR_INVALID_LENGTH;
    }
    else if (!model_handle_valid_and_allocated(handle) ||
             m_model_pool[handle].model_info.element_index >= ACCESS_ELEMENT_COUNT)
    {
        *p_status = NRF_ERROR_NOT_FOUND;
    }
    else if ((p_rx_message == NULL &&
              (m_model_pool[handle].model_info.publish_appkey_handle  == DSM_HANDLE_INVALID ||
               m_model_pool[handle].model_info.publish_address_handle == DSM_HANDLE_INVALID)) ||
             !is_valid_opcode(p_tx_message->opcode))
    {
        *p_status = NRF_ERROR_INVALID_PARAM;
    }
    else
    {
        *p_status = NRF_SUCCESS;
    }

    return (NRF_SUCCESS == *p_status);
}

static uint32_t packet_tx(access_model_handle_t handle,
                          const access_message_tx_t * p_tx_message,
                          const access_message_rx_t * p_rx_message)
{
    uint32_t status;
    if (!check_tx_params(handle, p_tx_message, p_rx_message, &status))
    {
        return status;
    }

    nrf_mesh_tx_params_t tx_params;
    uint8_t p_data[p_tx_message->length + access_utils_opcode_size_get(p_tx_message->opcode)];

    opcode_set(p_tx_message->opcode, p_data);
    memcpy(&p_data[access_utils_opcode_size_get(p_tx_message->opcode)], p_tx_message->p_buffer, p_tx_message->length);

    dsm_local_unicast_address_t local_addresses;
    dsm_local_unicast_addresses_get(&local_addresses);
    if (local_addresses.count <= m_model_pool[handle].model_info.element_index)
    {
        return NRF_ERROR_INVALID_ADDR;
    }

    if (NULL != p_rx_message)
    {
        tx_params.dst.type = p_rx_message->meta_data.src.type;
        tx_params.dst.value = p_rx_message->meta_data.src.value;
        NRF_MESH_ERROR_CHECK(dsm_tx_secmat_get(p_rx_message->meta_data.appkey_handle, &tx_params.security_material));
    }
    else
    {
        NRF_MESH_ERROR_CHECK(dsm_address_get(m_model_pool[handle].model_info.publish_address_handle, &tx_params.dst));
        NRF_MESH_ERROR_CHECK(dsm_tx_secmat_get(m_model_pool[handle].model_info.publish_appkey_handle, &tx_params.security_material));
    }

    if (m_model_pool[handle].model_info.publish_ttl == ACCESS_TTL_USE_DEFAULT)
    {
        tx_params.ttl = m_default_ttl;
    }
    else
    {
        tx_params.ttl = m_model_pool[handle].model_info.publish_ttl;
    }

    tx_params.src = local_addresses.address_start + m_model_pool[handle].model_info.element_index;
    tx_params.p_data = p_data;
    tx_params.data_len = p_tx_message->length + access_utils_opcode_size_get(p_tx_message->opcode);

    status = nrf_mesh_packet_send(&tx_params, NULL);
    if (status == NRF_SUCCESS)
    {
        __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "TX: [aop: 0x%04x]\n", p_tx_message->opcode.opcode);
    }
    return status;
}

static void access_state_clear(void)
{
    memset(&m_model_pool[0], 0, sizeof(m_model_pool));
    memset(&m_element_pool[0], 0, sizeof(m_element_pool));
    memset(&m_subscription_list_pool[0], 0, sizeof(m_subscription_list_pool));
    for (uint16_t i = 0; i < sizeof(m_model_pool)/sizeof(m_model_pool[0]); ++i)
    {
        m_model_pool[i].model_info.publish_address_handle = DSM_HANDLE_INVALID;
        m_model_pool[i].model_info.publish_appkey_handle = DSM_HANDLE_INVALID;
        m_model_pool[i].model_info.subscription_pool_index = ACCESS_SUBSCRIPTION_LIST_COUNT;
        m_model_pool[i].model_info.element_index = ACCESS_ELEMENT_INDEX_INVALID;
    }
}

#if PERSISTENT_STORAGE
/** Global flag to keep track of if the flash metadata is up to date.*/
static bool m_metadata_stored;

/** Global flag to keep track of if the flash_manager is not ready for use (being erased or not added) .*/
static bool m_flash_not_ready;

